county = [
"臺北市","台北市","新北市","桃園市","臺中市","台中市","臺南市","台南市","高雄市","基隆市","新竹市","嘉義市",
"新竹縣","苗栗縣","彰化縣","南投縣","雲林縣","嘉義縣","屏東縣","宜蘭縣","花蓮縣","臺東縣","澎湖縣","金門縣","連江縣","台東縣",
"宜蘭","花蓮","臺東","台東","澎湖","金門","連江","臺北","台北","新北","桃園","臺中","台中","臺南","台南","高雄","基隆","新竹","苗栗","彰化","南投","雲林","嘉義","屏東","馬祖"
]

mapping = {
'台東縣': '臺東縣',
'基隆': '基隆市',
'臺南': '臺南市',
'新北': '新北市',
'台北市': '臺北市',
'台中': '臺中市',
'馬祖': '連江',
'台中市': '臺中市',
'台南市': '臺南市',
'台北': '臺北市',
'金門': '金門縣',
'澎湖': '澎湖縣',
'台東': '臺東縣',
'桃園': '桃園市',
'苗栗': '苗栗縣',
'臺東': '臺東縣',
'臺北': '臺北市',
'臺中': '臺中市',
'連江': '連江縣',
'屏東': '屏東縣',
'彰化': '彰化縣',
'新竹': '新竹市',
'花蓮': '花蓮縣',
'高雄': '高雄市',
'嘉義': '嘉義市',
'南投': '南投縣',
'宜蘭': '宜蘭縣',
'台南': '臺南市',
'雲林': '雲林縣'
}
